Model: "res_ne_xt"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              multiple                  9472      
_________________________________________________________________
batch_normalization (BatchNo multiple                  256       
_________________________________________________________________
max_pooling2d (MaxPooling2D) multiple                  0         
_________________________________________________________________
sequential (Sequential)      (None, 60, 80, 256)       344832    
_________________________________________________________________
sequential_1 (Sequential)    (None, 30, 40, 512)       2004992   
_________________________________________________________________
sequential_2 (Sequential)    (None, 15, 20, 1024)      49497088  
_________________________________________________________________
sequential_3 (Sequential)    (None, 8, 10, 2048)       22996992  
_________________________________________________________________
global_average_pooling2d (Gl multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  28686     
=================================================================
Total params: 74,882,318
Trainable params: 74,687,118
Non-trainable params: 195,200
_________________________________________________________________
Epoch: 0/50, step: 1/95, loss: 3.10760, accuracy: 0.06250
Epoch: 0/50, step: 2/95, loss: 4.61020, accuracy: 0.15625
Epoch: 0/50, step: 3/95, loss: 5.38188, accuracy: 0.14583
Epoch: 0/50, step: 4/95, loss: 4.94592, accuracy: 0.18750
Epoch: 0/50, step: 5/95, loss: 4.39788, accuracy: 0.21250
Epoch: 0/50, step: 6/95, loss: 3.91335, accuracy: 0.23958
Epoch: 0/50, step: 7/95, loss: 3.54485, accuracy: 0.27679
Epoch: 0/50, step: 8/95, loss: 3.39821, accuracy: 0.28906
Epoch: 0/50, step: 9/95, loss: 3.16377, accuracy: 0.30556
Epoch: 0/50, step: 10/95, loss: 2.97091, accuracy: 0.31875
Epoch: 0/50, step: 11/95, loss: 2.83718, accuracy: 0.34659
Epoch: 0/50, step: 12/95, loss: 2.72942, accuracy: 0.35417
